WS-I/BP1.2/Messages/BaseDataTypes/XmlFormatter/RpcLit/SoapWsdl.BaseDataTypes.XmlFormatter.RpcLit_RetBase64Binary_Client_Request-2.xml

<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <a:Action s:mustUnderstand="1">http://tempuri.org/IBaseDataTypesRpcLit/RetBase64Binary</a:Action>
    <a:MessageID>urn:uuid:1c11a47c-2188-4c73-b775-4a00fb42631a</a:MessageID>
    <a:ReplyTo>
      <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
    </a:ReplyTo>
  </s:Header>
  <s:Body>
    <RetBase64Binary xmlns="http://tempuri.org/">
      <inByteArray xmlns="">AA==</inByteArray>
    </RetBase64Binary>
  </s:Body>
</s:Envelope>